
// Nano

int main(void) // Timer Counter 2
{  
    TCCR2A |= (1<<WGM21) | (1<<WGM20); // выбор режима - Fast PWM
    TCCR2A|=(1<<COM2A1); // сброс по совпадению 

    //TCCR2B |= (1<<CS21); // делитель на 8  (0b010)
    //TCCR2B |= (1<<CS20) | (1<<CS21); // делитель на 32  (0b011)
    //TCCR2B |= (1<<CS22); // делитель на 64  (0b100)
    //TCCR2B |= (1<<CS20) | (1<<CS22); // делитель на 128  (0b101)
    //TCCR2B |= (1<<CS21) | (1<<CS22); // делитель на 256  (0b110)
    TCCR2B |= (1<<CS20) | (1<<CS21) | (1<<CS22); // делитель на 1024  (0b111)
  
    // Oscillator Calibration Register
    //OSCCAL = 10; // регистр сравнения (не пойму зачем)


    // ПОДКЛЮЧАЕМ buzer К ПИНУ PB3 (11 пин ардуины)
    DDRB |= (1<<PB3);// пин OC2A на выход


    while (1) {
    }
    
}
